src/InformationRegisters/ЗначенияПоказателейСхемМотивации/ЗначенияПоказателейСхемМотивации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияПоказателейСхемМотивации</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиСхемМотивации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РаботникиОрганизаций/РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПлановыеНачисленияРаботниковОрганизаций/ПлановыеНачисленияРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеНачисленияРаботниковОрганизаций</name>
  <comment>(Регл) Начало действия начисления начало дня, окончание начисления - конец дня</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.ВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта1</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Показатель2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта2</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Показатель5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд2</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта3</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд3</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Валюта5</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта6</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд1</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта4</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд4</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд5</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд6</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ВидУчетаВремениДляСредней</name>
    <type>
      <types>EnumRef.ВидыУчетаВремениДляСредней</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчетаИзмерение</name>
    <type>
      <types>ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОплатаПоСреднемуЗаработку</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Работники/Работники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Работники</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаУвольнения</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПлановыеНачисленияРаботников/ПлановыеНачисленияРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеНачисленияРаботников</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.УправленческиеНачисления</types>
    </type>
  </resources>
  <resources>
    <name>ВидРасчетаЗавершения</name>
    <type>
      <types>ChartOfCalculationTypesRef.УправленческиеНачисления</types>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта1</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд1</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта2</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд2</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта3</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд3</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта4</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд4</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Действие</name>
    <type>
      <types>EnumRef.ВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеЗавершения</name>
    <type>
      <types>EnumRef.ВидыДействияСНачислением</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель1Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель2Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель3Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта1Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта2Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта3Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта5</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд1Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд2Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд3Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд5</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта6</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд6</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>Показатель4Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель5Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Показатель6Завершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта4Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта5Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Валюта6Завершения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд4Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд5Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <resources>
    <name>ТарифныйРазряд6Завершения</name>
    <type>
      <types>CatalogRef.ТарифныеРазряды</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчетаИзмерение</name>
    <type>
      <types>ChartOfCalculationTypesRef.УправленческиеНачисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗначенияПоказателейСхемМотивации/RecordSetModule.bsl
Процедура Автозаполнение(ТаблицаЗапроса = Неопределено, Сотрудники = Неопределено, Показатели = Неопределено, ОдинВидРасчета = Ложь, ИзДокумента = Ложь) Экспорт 
	
	Организация = Отбор.Организация.Значение;
	
	СписокНедоступныхВозможностейИзменения = Новый Массив;
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.ПустаяСсылка());
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется);
	СписокНедоступныхВозможностейИзменения.Добавить(Перечисления.ИзменениеПоказателейСхемМотивации.ИзменяетсяПриРасчете);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПарамВозможностьИзменения", СписокНедоступныхВозможностейИзменения);
	Запрос.УстановитьПараметр("ПарамДата", Отбор.ПериодДействия.Значение);
	
	Запрос.УстановитьПараметр("Сотрудники",Сотрудники);
	Запрос.УстановитьПараметр("Показатели",Показатели);

	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Отбор.ПериодДействия.Значение));
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		
		
		//ВТСотрудники
		СотрудникиТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РаботникиОрганизаций.Сотрудник 					КАК Сотрудник,
		|	РаботникиОрганизаций.ПодразделениеОрганизации 	КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
		|	И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник					КАК Сотрудник,
		|	РаботникиОрганизаций.ПодразделениеОрганизации	КАК Подразделение
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Период > &ПарамДата
		|	И РаботникиОрганизаций.Период <= &КонецМесяца
		|	И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
		|	И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
		|
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник"; 
		
		Запрос.Текст = СотрудникиТекст;
		Запрос.Выполнить();
		СотрудникиТекст = "ВТСотрудники";
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСотрудники";
		
				
		//ВТПлановыеПоказатели
		Запрос.Текст = "
		|ВЫБРАТЬ
		|		&ГоловнаяОрганизация КАК Организация,
		|		Сотрудники.Подразделение КАК Подразделение,
		|		&ПарамДата КАК ПериодДействия,
		|		ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|		ВложенныйЗапрос.Показатель КАК Показатель,
		|		СУММА(ЕСТЬNULL(ВложенныйЗапрос.Значение, 0)) КАК Значение,
		|		ВложенныйЗапрос.Валюта КАК Валюта
		|	ПОМЕСТИТЬ ВТПлановыеПоказатели
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|			Показатели.Показатель КАК Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1) КАК Значение,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1 КАК Валюта
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ГоловнаяОрганизация  И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 1)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ГоловнаяОрганизация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 2)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель3),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ГоловнаяОрганизация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 3)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель4),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта4
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ГоловнаяОрганизация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта4
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель5),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта5
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ГоловнаяОрганизация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 5)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта5,
		|			Показатели.Показатель
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель6),
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта6
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ПарамДата, Организация = &ГоловнаяОрганизация И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 6)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта6
		|		
		|) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО Сотрудники.Сотрудник = ВложенныйЗапрос.Сотрудник
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Сотрудники.Подразделение,
		|		ВложенныйЗапрос.Сотрудник,
		|		ВложенныйЗапрос.Показатель,
		|		ВложенныйЗапрос.Валюта
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель,
		|	Сотрудник,
		|	Подразделение
		|";
		
		Запрос.Выполнить();
		
		ВТПлановыеПоказатели = "ВТПлановыеПоказатели";
		Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПлановыеПоказатели";
		
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Показатели.Организация КАК Организация,
		|	Показатели.Подразделение КАК Подразделение,
		|	Показатели.ПериодДействия КАК ПериодДействия,
		|	Показатели.Сотрудник КАК Сотрудник,
		|	Показатели.Показатель КАК Показатель,
		|	Показатели.Валюта,
		|	СУММА(Показатели.Значение) КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПлановыеПоказатели.Организация КАК Организация,
		|		ПлановыеПоказатели.Подразделение КАК Подразделение,
		|		ПлановыеПоказатели.ПериодДействия КАК ПериодДействия,
		|		ПлановыеПоказатели.Сотрудник КАК Сотрудник,
		|		ПлановыеПоказатели.Показатель КАК Показатель,
		|		ПлановыеПоказатели.Значение КАК Значение,
		|		ПлановыеПоказатели.Валюта КАК Валюта
		|	ИЗ
		|		ВТПлановыеПоказатели КАК ПлановыеПоказатели
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		&ГоловнаяОрганизация,
		|		ЗначенияПоказателейСхемМотивации.Подразделение,
		|		&ПарамДата,
		|		ЗначенияПоказателейСхемМотивации.Сотрудник,
		|		ЗначенияПоказателейСхемМотивации.Показатель,
		|		ЕСТЬNULL(ЗначенияПоказателейСхемМотивации.Значение, 0),
		|		ЗначенияПоказателейСхемМотивации.Валюта
		|	ИЗ
		|		РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
		|	ГДЕ
		|		ЗначенияПоказателейСхемМотивации.Организация = &ГоловнаяОрганизация
		|		И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
		|		И ЗначенияПоказателейСхемМотивации.Показатель В(&Показатели)
		|		И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата
		|) КАК Показатели
		|
		|ГДЕ Показатели.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|
		|СГРУППИРОВАТЬ ПО
		|	Показатели.Сотрудник,
		|	Показатели.Показатель,
		|	Показатели.Подразделение,
		|	Показатели.Валюта,
		|	Показатели.Организация,
		|	Показатели.ПериодДействия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	Подразделение,
		|	Сотрудник,
		|	Показатель";
					
	Иначе
		//ВТСотрудники
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Отбор.ПериодДействия.Значение));
		
		Запрос.УстановитьПараметр("Сотрудники",Сотрудники);
		Запрос.УстановитьПараметр("Показатели",Показатели);
		
		СотрудникиТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Работники.ФизЛицо КАК ФизЛицо,
		|	Работники.Подразделение
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(&ПарамДата, ) КАК Работники
		|ГДЕ
		|	Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.ФизЛицо,
		|	NULL
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|ГДЕ
		|	Работники.Период > &ПарамДата
		|	И Работники.Период <= &КонецМесяца
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Работники.ФизЛицо,
		|	NULL
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК ПериодыПерекрытия
		|		ПО (ПериодыПерекрытия.Период > Работники.Период)
		|ГДЕ
		|	ПериодыПерекрытия.Период ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо";
		
		Запрос.Текст = СотрудникиТекст;
		Запрос.Выполнить();
		СотрудникиТекст = "ВТСотрудники";
		
		//ВТПлановыеПоказатели
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Подразделение КАК Подразделение,
		|	&ПарамДата КАК ПериодДействия,
		|	ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
		|	ВложенныйЗапрос.Показатель КАК Показатель,
		|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.Значение, 0)) КАК Значение,
		|	ВложенныйЗапрос.Валюта КАК Валюта
		|	ПОМЕСТИТЬ ВТПлановыеПоказатели
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|			Показатели.Показатель КАК Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель1) КАК Значение,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта1 КАК Валюта
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 1)
		|				И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|				И ((НЕ Показатели.Показатель.Предопределенный))
		|				И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|				И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|				И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта1
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель2),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта2
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата,ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 2)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта2
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель3),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта3
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 3)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта3
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель4),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта4
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта4
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель5),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта5
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 5)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта5
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(ПлановыеНачисленияРаботниковСрезПоследних.Показатель6),
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта6
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеНачисленияРаботниковСрезПоследних
		|				ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
		|				ПО (Показатели.НомерСтроки = 4)
		|					И (Показатели.Ссылка = ПлановыеНачисленияРаботниковСрезПоследних.ВидРасчета)
		|					И ((НЕ Показатели.Показатель.Предопределенный))
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеНачисленияРаботниковСрезПоследних.ФизЛицо,
		|			Показатели.Показатель,
		|			ПлановыеНачисленияРаботниковСрезПоследних.Валюта6
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			Показатели.ФизЛицо,
		|			Показатели.Показатель,
		|			СУММА(Показатели.Значение),
		|			Показатели.Валюта
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель1) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта1 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 1)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта1
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель2) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта2 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 2)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта2
		
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель3) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта3 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 3)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта3
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель4) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта4 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 4)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта4
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель5) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта5 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 3)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта5
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо КАК ФизЛицо,
		|				Показатели.Показатель КАК Показатель,
		|				СУММА(ПлановыеУдержанияРаботниковСрезПоследних.Показатель6) КАК Значение,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта6 КАК Валюта
		|			ИЗ
		|				РегистрСведений.ПлановыеУдержанияРаботников.СрезПоследних(&ПарамДата, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВТСотрудники)) КАК ПлановыеУдержанияРаботниковСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
		|					ПО (Показатели.НомерСтроки = 6)
		|						И (Показатели.Ссылка = ПлановыеУдержанияРаботниковСрезПоследних.ВидРасчета)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|						И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|						И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановыеУдержанияРаботниковСрезПоследних.ФизЛицо,
		|				Показатели.Показатель,
		|				ПлановыеУдержанияРаботниковСрезПоследних.Валюта6) КАК Показатели
		|		ГДЕ
		|			Показатели.Показатель ЕСТЬ НЕ NULL 
		|			И (НЕ Показатели.Показатель.Предопределенный)
		|			И Показатели.Показатель В (&Показатели)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)		
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Показатели.Показатель,
		|			Показатели.ФизЛицо,
		|			Показатели.Валюта) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО Сотрудники.ФизЛицо = ВложенныйЗапрос.ФизЛицо
		
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Сотрудники.Подразделение,
		|		ВложенныйЗапрос.ФизЛицо,
		|		ВложенныйЗапрос.Показатель,
		|		ВложенныйЗапрос.Валюта
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель,
		|	ФизЛицо,
		|	Подразделение";
		Запрос.Выполнить();
		
		ВТПоказателиИСотрудники = "ВТПоказателиИСотрудники";
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	ИтоговаяТаблица.Подразделение КАК Подразделение,
		|	ЕСТЬNULL(Сотрудники.Сотрудник, ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)) КАК Сотрудник,
		|	ИтоговаяТаблица.Показатель КАК Показатель,
		|	ИтоговаяТаблица.ПериодДействия КАК ПериодДействия,
		|	ИтоговаяТаблица.Валюта КАК Валюта,
		|	СУММА(ЕСТЬNULL(ИтоговаяТаблица.ФактическоеЗначение, ИтоговаяТаблица.ПлановоеЗначение)) КАК Значение
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложеннаяТаблица.Показатель КАК Показатель,
		|		ВложеннаяТаблица.Подразделение КАК Подразделение,
		|		ВложеннаяТаблица.Сотрудник КАК Сотрудник,
		|		ВложеннаяТаблица.ПериодДействия КАК ПериодДействия,
		|		МАКСИМУМ(ВложеннаяТаблица.Валюта) КАК Валюта,
		|		МАКСИМУМ(ВложеннаяТаблица.ФактическоеЗначение) КАК ФактическоеЗначение,
		|		МАКСИМУМ(ВложеннаяТаблица.ПлановоеЗначение) КАК ПлановоеЗначение
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Факт.Показатель КАК Показатель,
		|			Факт.Подразделение КАК Подразделение,
		|			Факт.Сотрудник.Физлицо КАК Сотрудник,
		|			Факт.ПериодДействия КАК ПериодДействия,
		|			МАКСИМУМ(Факт.Валюта) КАК Валюта,
		|			СУММА(ЕСТЬNULL(Факт.Значение, 0)) КАК ФактическоеЗначение,
		|			NULL КАК ПлановоеЗначение
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
		|				ВЫБОР
		|					КОГДА ЗначенияПоказателейСхемМотивации.Подразделение = НЕОПРЕДЕЛЕНО
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ИНАЧЕ ЗначенияПоказателейСхемМотивации.Подразделение
		|				КОНЕЦ КАК Подразделение,
		|				ВЫБОР
		|					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|				КОНЕЦ КАК Сотрудник,
		|				ЗначенияПоказателейСхемМотивации.ПериодДействия КАК ПериодДействия,
		|				МАКСИМУМ(ЗначенияПоказателейСхемМотивации.Валюта) КАК Валюта,
		|				СУММА(ЗначенияПоказателейСхемМотивации.Значение) КАК Значение
		|			ИЗ
		|				РегистрСведений.ЗначенияПоказателейСхемМотивации КАК ЗначенияПоказателейСхемМотивации
		|			ГДЕ
		|				ЗначенияПоказателейСхемМотивации.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				И (НЕ ЗначенияПоказателейСхемМотивации.Показатель.Предопределенный)
		|				И ЗначенияПоказателейСхемМотивации.ПериодДействия = &ПарамДата
		|				И ((ЗначенияПоказателейСхемМотивации.Сотрудник В (&Сотрудники)) ИЛИ ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя <> ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный))
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ЗначенияПоказателейСхемМотивации.Показатель,
		|				ВЫБОР
		|					КОГДА ЗначенияПоказателейСхемМотивации.Подразделение = НЕОПРЕДЕЛЕНО
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ИНАЧЕ ЗначенияПоказателейСхемМотивации.Подразделение
		|				КОНЕЦ,
		|				ЗначенияПоказателейСхемМотивации.Сотрудник,
		|				ЗначенияПоказателейСхемМотивации.ПериодДействия,
		|				ВЫБОР
		|					КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|						ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|				КОНЕЦ) КАК Факт
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Факт.Показатель,
		|			Факт.Подразделение,
		|			Факт.Сотрудник,
		|			Факт.ПериодДействия,
		|			Факт.Сотрудник.Физлицо
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			ПЛАН.Показатель,
		|			ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка),
		|			ВЫБОР
		|				КОГДА ПЛАН.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|					ТОГДА ПЛАН.ФизЛицо
		|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|			КОНЕЦ,
		|			ПЛАН.ПериодДействия,
		|			ВЫБОР
		|				КОГДА ПЛАН.Валюта = НЕОПРЕДЕЛЕНО
		|					ТОГДА NULL
		|				ИНАЧЕ ПЛАН.Валюта
		|			КОНЕЦ,
		|			NULL,
		|			ЕСТЬNULL(ПЛАН.Значение, 0)
		|		ИЗ
		|			ВТПлановыеПоказатели КАК ПЛАН) КАК ВложеннаяТаблица
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложеннаяТаблица.Подразделение,
		|		ВложеннаяТаблица.Сотрудник,
		|		ВложеннаяТаблица.Показатель,
		|		ВложеннаяТаблица.ПериодДействия) КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СписокСотрудников.Сотрудник КАК Сотрудник,
		|			СписокСотрудников.Физлицо КАК Физлицо
		|		ИЗ
		|			(ВЫБРАТЬ
		|				МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
		|				РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|				1 КАК Приоритет
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|			ГДЕ
		|				РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиОсновноеМесто.Сотрудник.Физлицо
		|			
		|			ОБЪЕДИНИТЬ
		|			
		|			ВЫБРАТЬ
		|				МАКСИМУМ(РаботникиСовместительство.Сотрудник),
		|				РаботникиСовместительство.Сотрудник.Физлицо,
		|				2
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПарамДата, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|			ГДЕ
		|				РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиСовместительство.Сотрудник.Физлицо
		|			
		|			ОБЪЕДИНИТЬ
		|			
		|			ВЫБРАТЬ
		|				МАКСИМУМ(СотрудникиДУ.Ссылка),
		|				СотрудникиДУ.Физлицо,
		|				ВЫБОР
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|						ТОГДА 3
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|						ТОГДА 4
		|					ИНАЧЕ 5
		|				КОНЕЦ
		|			ИЗ
		|				Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
		|			
		|			СГРУППИРОВАТЬ ПО
		|				СотрудникиДУ.Физлицо,
		|				ВЫБОР
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|						ТОГДА 3
		|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|						ТОГДА 4
		|					ИНАЧЕ 5
		|				КОНЕЦ) КАК СписокСотрудников
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					СписокФизическихЛиц.Физлицо КАК Физлицо,
		|					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
		|				ИЗ
		|					(ВЫБРАТЬ
		|						РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
		|						1 КАК Приоритет
		|					ИЗ
		|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|								&ПарамДата,
		|								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
		|					ГДЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|					
		|					ОБЪЕДИНИТЬ
		|					
		|					ВЫБРАТЬ
		|						РаботникиСовместительство.Сотрудник.Физлицо,
		|						2
		|					ИЗ
		|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|								&ПарамДата,
		|								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
		|					ГДЕ  РаботникиСовместительство.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|					
		|					ОБЪЕДИНИТЬ
		|					
		|					ВЫБРАТЬ
		|						СотрудникиДУ.Физлицо,
		|						ВЫБОР
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
		|								ТОГДА 3
		|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|								ТОГДА 4
		|							ИНАЧЕ 5
		|						КОНЕЦ
		|					ИЗ
		|						Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
		|				
		|				СГРУППИРОВАТЬ ПО
		|					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
		|				ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
		|					И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
		|		ПО ИтоговаяТаблица.Сотрудник = Сотрудники.Физлицо
		|
		|ГДЕ ИтоговаяТаблица.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|И (Сотрудники.Сотрудник ЕСТЬ НЕ NULL ИЛИ ИтоговаяТаблица.Показатель.ТипПоказателя <> Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный))
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговаяТаблица.Подразделение,
		|	Сотрудники.Сотрудник,
		|	ИтоговаяТаблица.Показатель,
		|	ИтоговаяТаблица.ПериодДействия,
		|	ИтоговаяТаблица.Валюта
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подразделение,
		|	Сотрудники.Сотрудник.Наименование,
		|	Показатель";
	КонецЕсли;
	
	ЭтотОбъект.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // Автозаполнение
